app/controllers/coffees_controller.rb

SELECT "coffees".* FROM "coffees"
---
  def index
    @coffees = Coffee.all

UPDATE "coffees" SET "name" = ?, "updated_at" = ? WHERE "coffees"."id" = ?  [["name", "Capuccinoo"], ["updated_at", "2023-12-09 00:32:05.396653"], ["id", 1]]
---
  def update
    if @coffee.update(coffee_params)

SELECT "coffees".* FROM "coffees"
---
  def manage_catalog
    @coffees = Coffee.all

INSERT INTO "coffees" ("name", "description", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Capuccino"], ["description", "cafe com leite"], ["category", "espresso"], ["created_at", "2023-12-09 00:14:18.933470"], ["updated_at", "2023-12-09 00:14:18.933470"]]
---
  def create_coffee
    @coffee = Coffee.new(coffee_params)

    if @coffee.save

SELECT "coffees".* FROM "coffees" WHERE "coffees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_coffee
    @coffee = Coffee.find(params[:id])