app/controllers/home_controller.rb

SELECT "coffees".* FROM "coffees"
---
  def index
    @coffees = Coffee.all